RT-Thread/rt-thread/bsp/stm32f767-apollo/Libraries/CMSIS/Device/ST/STM32F7xx/Source/Templates/iar/startup_stm32f777xx.s
        PUBWEAK SPI5_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SPI5_IRQHandler   
        B SPI5_IRQHandler                  

        PUBWEAK SPI6_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SPI6_IRQHandler 
        B SPI6_IRQHandler                    

        PUBWEAK SAI1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SAI1_IRQHandler  
        B SAI1_IRQHandler                  

        PUBWEAK LTDC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LTDC_IRQHandler 
        B LTDC_IRQHandler                     

        PUBWEAK LTDC_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LTDC_ER_IRQHandler 
        B LTDC_ER_IRQHandler                 

        PUBWEAK DMA2D_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DMA2D_IRQHandler 
        B DMA2D_IRQHandler                  

       PUBWEAK SAI2_IRQHandler
       SECTION .text:CODE:NOROOT:REORDER(1) 
SAI2_IRQHandler 
        B SAI2_IRQHandler          

       PUBWEAK QUADSPI_IRQHandler
       SECTION .text:CODE:NOROOT:REORDER(1) 
QUADSPI_IRQHandler 
        B QUADSPI_IRQHandler       
        
        PUBWEAK LPTIM1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
LPTIM1_IRQHandler 
        B LPTIM1_IRQHandler   
        
        PUBWEAK CEC_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CEC_IRQHandler 
        B CEC_IRQHandler 

        PUBWEAK I2C4_EV_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
I2C4_EV_IRQHandler 
        B I2C4_EV_IRQHandler   
        
        PUBWEAK I2C4_ER_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
I2C4_ER_IRQHandler 
        B I2C4_ER_IRQHandler 
 
        PUBWEAK SPDIF_RX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SPDIF_RX_IRQHandler 
        B SPDIF_RX_IRQHandler

        PUBWEAK DFSDM1_FLT0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT0_IRQHandler 
        B DFSDM1_FLT0_IRQHandler

        PUBWEAK DFSDM1_FLT1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT1_IRQHandler 
        B DFSDM1_FLT1_IRQHandler

        PUBWEAK DFSDM1_FLT2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT2_IRQHandler 
        B DFSDM1_FLT2_IRQHandler

        PUBWEAK DFSDM1_FLT3_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
DFSDM1_FLT3_IRQHandler 
        B DFSDM1_FLT3_IRQHandler

        PUBWEAK SDMMC2_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
SDMMC2_IRQHandler 
        B SDMMC2_IRQHandler

        PUBWEAK CAN3_TX_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CAN3_TX_IRQHandler 
        B CAN3_TX_IRQHandler

        PUBWEAK CAN3_RX0_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CAN3_RX0_IRQHandler 
        B CAN3_RX0_IRQHandler

        PUBWEAK CAN3_RX1_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CAN3_RX1_IRQHandler 
        B CAN3_RX1_IRQHandler

        PUBWEAK CAN3_SCE_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
CAN3_SCE_IRQHandler 
        B CAN3_SCE_IRQHandler

        PUBWEAK JPEG_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
JPEG_IRQHandler 
        B JPEG_IRQHandler

        PUBWEAK MDIOS_IRQHandler
        SECTION .text:CODE:NOROOT:REORDER(1) 
MDIOS_IRQHandler 
        B MDIOS_IRQHandler            
        END
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
